app/controllers/elders_controller.rb

  def login
    elder = Elder.find_by(username: params[:elder][:username])
---
SELECT  "elders".* FROM "elders" WHERE "elders"."username" = $1 LIMIT $2  [["username", "tom"], ["LIMIT", 1]]

  def index
    @elders = Elder.all
---
SELECT "elders".* FROM "elders"

  def create
    @elder = Elder.new(elder_params)


    if @elder.save
---
INSERT INTO "elders" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dorris"], ["phone", "9878878994"], ["email", "slfjjfls@poop.comm"], ["created_at", "2017-09-09 21:08:38.301239"], ["updated_at", "2017-09-09 21:08:38.301239"]]

  def update
    if @elder.update(elder_params)
---
UPDATE "elders" SET "name" = $1, "phone" = $2, "email" = $3, "updated_at" = $4 WHERE "elders"."id" = $5  [["name", "newupdate"], ["phone", "s"], ["email", "slfjjfls@poop.comm"], ["updated_at", "2017-09-09 21:10:37.921017"], ["id", 20]]

  def destroy
    @elder.destroy
---
DELETE FROM "elders" WHERE "elders"."id" = $1  [["id", 21]]

    def set_elder
      @elder = Elder.find(params[:id])
---
SELECT  "elders".* FROM "elders" WHERE "elders"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]