app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("task_name", "date_needed", "location", "duration", "details", "phone", "email", "created_at", "updated_at", "elder_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @task = Task.new(task_params)
    # creating a task params id to belong to an elder
    @task.elder_id = params[:elder_id]

    if @task.save

UPDATE "tasks" SET "task_name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["task_name", "clean"], ["updated_at", "2017-09-10 00:20:36.807832"], ["id", 2]]
---
  def update
    if @task.update(task_params)